jun => xia

百度：

侠 （汉字）
侠指有能力的人不求回报地去帮助比自己弱小的人.这是一种精神也是一种社会追求。

一、字义
⒈ 依靠自己的力量帮助被欺侮者的人或行为：～客。武～。游～。～骨。～肝义胆。
侠的最高境界，侠之大者，为国为民
详细字义
〈名〉
⒈ （形声。从人，夹声。本义：侠义）
⒉ 同本义。指见义勇为、肯舍己助人的性格、气质或行为 [knight-errantry]
侠，俜也。——《说文》
所谓言必行，行必果，己诺 必诚，不爱其躯，赴士之阨困，千里诵义者也。荀悦曰，立气齐，作威福，结私交，以立强于世者，谓之游侠。——《史记·游侠传》
刘义者，亦一节士。少放肆为侠行，因酒杀人亡命。——《新唐书·刘义传》
这十三妹是一位正气不过的侠女，你为何这等唐突他起来?——《儿女英雄传》
⒊ 又如：侠奴（侠义的奴仆）；侠情（见义勇为、舍己助人的感情）
⒋ 侠客 [knight-errant]
材力绝人，少重然许，喜侠节。——《新唐书·窦建德传》
⒌ 又如：游侠；武侠；剑侠；豪侠；大侠；女侠；侠节（侠客的节操）
⒍ 姓
〈动〉
⒈ 要挟 [coerce;force]
凶强侠气（粗暴强悍，以力欺人。侠，这里指“要挟”。侠气，以力欺人，为人霸道）。——《世说新语·自新》
为气任侠。——《史记·季布传》
二、分门别类
⒈墨侠：春秋战国时期，诸子百家中墨家的一支，与墨辨组成墨家。代表人物有墨翟、徐夫人等。
⒉任侠：先秦时期对于游侠的统称。代表人物有盖聂、荆轲等。
⒊义侠：春秋战国时期，侠家的别称，据传为苏秦传人创立，以“侠义爱民”为教义。
三、说文解字
《卷八》《人部》　·侠俜也。从人夹声。胡颊切
四、康熙字典
【子集中】【人字部】 侠
解释：【唐韵】【正韵】??胡颊切，音协。任侠。相与信为任，同是非曰侠。【前·季布传】任侠有名。【师古曰】侠之言挟，以权力侠辅人也。　又姓。韩相侠累。又与挟通。【前·叔孙通传】殿下郞中侠陛。【扬子·法言】滕懽樊郦曰侠介。与挟同。　又【集韵】古洽切。与夹通。傍也，??也。【公羊传·哀四年注】滕薛侠毂。又【仪礼·士丧礼】妇人侠牀东西。【周礼·冬官考工记注】今时钟乳侠鼓与舞。与夹同。　俗作侠，非。

“我辈练功学武，所为何事？行侠仗义、济人困厄固然乃是本份，但这只是侠之小者。
江湖上所以尊称我一声『郭大侠』，实因敬我为国为民、奋不顾身的助守襄阳。
然我才力有限，不能为民解困，实在愧当『大侠』两字。
你聪明智慧过我十倍，将来成就定然远胜于我，这是不消说的。
只盼你心头牢牢记着『为国为民，侠之大者』这八个字，日后名扬天下，成为受万民敬仰的真正大侠。”
———— 金庸名著《神雕侠侣》 第二十回 郭靖之口中的侠之大者

Wikipedia：
1. chivalrous person
2. knight-errant
3. hero
